GopalSaraf/Practicals/PSDL/include/proc/pic18f45q10.inc
// Register: CLC4GLS2
#define CLC4GLS2 CLC4GLS2
CLC4GLS2                                 equ 0E4Dh
// bitfield definitions
CLC4GLS2_G3D1N_POSN                      equ 0000h
CLC4GLS2_G3D1N_POSITION                  equ 0000h
CLC4GLS2_G3D1N_SIZE                      equ 0001h
CLC4GLS2_G3D1N_LENGTH                    equ 0001h
CLC4GLS2_G3D1N_MASK                      equ 0001h
CLC4GLS2_G3D1T_POSN                      equ 0001h
CLC4GLS2_G3D1T_POSITION                  equ 0001h
CLC4GLS2_G3D1T_SIZE                      equ 0001h
CLC4GLS2_G3D1T_LENGTH                    equ 0001h
CLC4GLS2_G3D1T_MASK                      equ 0002h
CLC4GLS2_G3D2N_POSN                      equ 0002h
CLC4GLS2_G3D2N_POSITION                  equ 0002h
CLC4GLS2_G3D2N_SIZE                      equ 0001h
CLC4GLS2_G3D2N_LENGTH                    equ 0001h
CLC4GLS2_G3D2N_MASK                      equ 0004h
CLC4GLS2_G3D2T_POSN                      equ 0003h
CLC4GLS2_G3D2T_POSITION                  equ 0003h
CLC4GLS2_G3D2T_SIZE                      equ 0001h
CLC4GLS2_G3D2T_LENGTH                    equ 0001h
CLC4GLS2_G3D2T_MASK                      equ 0008h
CLC4GLS2_G3D3N_POSN                      equ 0004h
CLC4GLS2_G3D3N_POSITION                  equ 0004h
CLC4GLS2_G3D3N_SIZE                      equ 0001h
CLC4GLS2_G3D3N_LENGTH                    equ 0001h
CLC4GLS2_G3D3N_MASK                      equ 0010h
CLC4GLS2_G3D3T_POSN                      equ 0005h
CLC4GLS2_G3D3T_POSITION                  equ 0005h
CLC4GLS2_G3D3T_SIZE                      equ 0001h
CLC4GLS2_G3D3T_LENGTH                    equ 0001h
CLC4GLS2_G3D3T_MASK                      equ 0020h
CLC4GLS2_G3D4N_POSN                      equ 0006h
CLC4GLS2_G3D4N_POSITION                  equ 0006h
CLC4GLS2_G3D4N_SIZE                      equ 0001h
CLC4GLS2_G3D4N_LENGTH                    equ 0001h
CLC4GLS2_G3D4N_MASK                      equ 0040h
CLC4GLS2_G3D4T_POSN                      equ 0007h
CLC4GLS2_G3D4T_POSITION                  equ 0007h
CLC4GLS2_G3D4T_SIZE                      equ 0001h
CLC4GLS2_G3D4T_LENGTH                    equ 0001h
CLC4GLS2_G3D4T_MASK                      equ 0080h
CLC4GLS2_LC4G3D1N_POSN                   equ 0000h
CLC4GLS2_LC4G3D1N_POSITION               equ 0000h
CLC4GLS2_LC4G3D1N_SIZE                   equ 0001h
CLC4GLS2_LC4G3D1N_LENGTH                 equ 0001h
CLC4GLS2_LC4G3D1N_MASK                   equ 0001h
CLC4GLS2_LC4G3D1T_POSN                   equ 0001h
CLC4GLS2_LC4G3D1T_POSITION               equ 0001h
CLC4GLS2_LC4G3D1T_SIZE                   equ 0001h
CLC4GLS2_LC4G3D1T_LENGTH                 equ 0001h
CLC4GLS2_LC4G3D1T_MASK                   equ 0002h
CLC4GLS2_LC4G3D2N_POSN                   equ 0002h
CLC4GLS2_LC4G3D2N_POSITION               equ 0002h
CLC4GLS2_LC4G3D2N_SIZE                   equ 0001h
CLC4GLS2_LC4G3D2N_LENGTH                 equ 0001h
CLC4GLS2_LC4G3D2N_MASK                   equ 0004h
CLC4GLS2_LC4G3D2T_POSN                   equ 0003h
CLC4GLS2_LC4G3D2T_POSITION               equ 0003h
CLC4GLS2_LC4G3D2T_SIZE                   equ 0001h
CLC4GLS2_LC4G3D2T_LENGTH                 equ 0001h
CLC4GLS2_LC4G3D2T_MASK                   equ 0008h
CLC4GLS2_LC4G3D3N_POSN                   equ 0004h
CLC4GLS2_LC4G3D3N_POSITION               equ 0004h
CLC4GLS2_LC4G3D3N_SIZE                   equ 0001h
CLC4GLS2_LC4G3D3N_LENGTH                 equ 0001h
CLC4GLS2_LC4G3D3N_MASK                   equ 0010h
CLC4GLS2_LC4G3D3T_POSN                   equ 0005h
CLC4GLS2_LC4G3D3T_POSITION               equ 0005h
CLC4GLS2_LC4G3D3T_SIZE                   equ 0001h
CLC4GLS2_LC4G3D3T_LENGTH                 equ 0001h
CLC4GLS2_LC4G3D3T_MASK                   equ 0020h
CLC4GLS2_LC4G3D4N_POSN                   equ 0006h
CLC4GLS2_LC4G3D4N_POSITION               equ 0006h
CLC4GLS2_LC4G3D4N_SIZE                   equ 0001h
CLC4GLS2_LC4G3D4N_LENGTH                 equ 0001h
CLC4GLS2_LC4G3D4N_MASK                   equ 0040h
CLC4GLS2_LC4G3D4T_POSN                   equ 0007h
CLC4GLS2_LC4G3D4T_POSITION               equ 0007h
CLC4GLS2_LC4G3D4T_SIZE                   equ 0001h
CLC4GLS2_LC4G3D4T_LENGTH                 equ 0001h
CLC4GLS2_LC4G3D4T_MASK                   equ 0080h

// Register: CLC4GLS3
#define CLC4GLS3 CLC4GLS3
CLC4GLS3                                 equ 0E4Eh
// bitfield definitions
CLC4GLS3_G4D1N_POSN                      equ 0000h
CLC4GLS3_G4D1N_POSITION                  equ 0000h
CLC4GLS3_G4D1N_SIZE                      equ 0001h
CLC4GLS3_G4D1N_LENGTH                    equ 0001h
CLC4GLS3_G4D1N_MASK                      equ 0001h
CLC4GLS3_G4D1T_POSN                      equ 0001h
CLC4GLS3_G4D1T_POSITION                  equ 0001h
CLC4GLS3_G4D1T_SIZE                      equ 0001h
CLC4GLS3_G4D1T_LENGTH                    equ 0001h
CLC4GLS3_G4D1T_MASK                      equ 0002h
CLC4GLS3_G4D2N_POSN                      equ 0002h
CLC4GLS3_G4D2N_POSITION                  equ 0002h
CLC4GLS3_G4D2N_SIZE                      equ 0001h
CLC4GLS3_G4D2N_LENGTH                    equ 0001h
CLC4GLS3_G4D2N_MASK                      equ 0004h
CLC4GLS3_G4D2T_POSN                      equ 0003h
CLC4GLS3_G4D2T_POSITION                  equ 0003h
CLC4GLS3_G4D2T_SIZE                      equ 0001h
CLC4GLS3_G4D2T_LENGTH                    equ 0001h
CLC4GLS3_G4D2T_MASK                      equ 0008h
CLC4GLS3_G4D3N_POSN                      equ 0004h
CLC4GLS3_G4D3N_POSITION                  equ 0004h
CLC4GLS3_G4D3N_SIZE                      equ 0001h
CLC4GLS3_G4D3N_LENGTH                    equ 0001h
CLC4GLS3_G4D3N_MASK                      equ 0010h
CLC4GLS3_G4D3T_POSN                      equ 0005h
CLC4GLS3_G4D3T_POSITION                  equ 0005h
CLC4GLS3_G4D3T_SIZE                      equ 0001h
CLC4GLS3_G4D3T_LENGTH                    equ 0001h
CLC4GLS3_G4D3T_MASK                      equ 0020h
CLC4GLS3_G4D4N_POSN                      equ 0006h
CLC4GLS3_G4D4N_POSITION                  equ 0006h
CLC4GLS3_G4D4N_SIZE                      equ 0001h
CLC4GLS3_G4D4N_LENGTH                    equ 0001h
CLC4GLS3_G4D4N_MASK                      equ 0040h
CLC4GLS3_G4D4T_POSN                      equ 0007h
CLC4GLS3_G4D4T_POSITION                  equ 0007h
CLC4GLS3_G4D4T_SIZE                      equ 0001h
CLC4GLS3_G4D4T_LENGTH                    equ 0001h
CLC4GLS3_G4D4T_MASK                      equ 0080h
CLC4GLS3_LC4G4D1N_POSN                   equ 0000h
CLC4GLS3_LC4G4D1N_POSITION               equ 0000h
CLC4GLS3_LC4G4D1N_SIZE                   equ 0001h
CLC4GLS3_LC4G4D1N_LENGTH                 equ 0001h
CLC4GLS3_LC4G4D1N_MASK                   equ 0001h
CLC4GLS3_LC4G4D1T_POSN                   equ 0001h
CLC4GLS3_LC4G4D1T_POSITION               equ 0001h
CLC4GLS3_LC4G4D1T_SIZE                   equ 0001h
CLC4GLS3_LC4G4D1T_LENGTH                 equ 0001h
CLC4GLS3_LC4G4D1T_MASK                   equ 0002h
CLC4GLS3_LC4G4D2N_POSN                   equ 0002h
CLC4GLS3_LC4G4D2N_POSITION               equ 0002h
CLC4GLS3_LC4G4D2N_SIZE                   equ 0001h
CLC4GLS3_LC4G4D2N_LENGTH                 equ 0001h
CLC4GLS3_LC4G4D2N_MASK                   equ 0004h
CLC4GLS3_LC4G4D2T_POSN                   equ 0003h
CLC4GLS3_LC4G4D2T_POSITION               equ 0003h
CLC4GLS3_LC4G4D2T_SIZE                   equ 0001h
CLC4GLS3_LC4G4D2T_LENGTH                 equ 0001h
CLC4GLS3_LC4G4D2T_MASK                   equ 0008h
CLC4GLS3_LC4G4D3N_POSN                   equ 0004h
CLC4GLS3_LC4G4D3N_POSITION               equ 0004h
CLC4GLS3_LC4G4D3N_SIZE                   equ 0001h
CLC4GLS3_LC4G4D3N_LENGTH                 equ 0001h
CLC4GLS3_LC4G4D3N_MASK                   equ 0010h
CLC4GLS3_LC4G4D3T_POSN                   equ 0005h
CLC4GLS3_LC4G4D3T_POSITION               equ 0005h
CLC4GLS3_LC4G4D3T_SIZE                   equ 0001h
CLC4GLS3_LC4G4D3T_LENGTH                 equ 0001h
CLC4GLS3_LC4G4D3T_MASK                   equ 0020h
CLC4GLS3_LC4G4D4N_POSN                   equ 0006h
CLC4GLS3_LC4G4D4N_POSITION               equ 0006h
CLC4GLS3_LC4G4D4N_SIZE                   equ 0001h
CLC4GLS3_LC4G4D4N_LENGTH                 equ 0001h
CLC4GLS3_LC4G4D4N_MASK                   equ 0040h
CLC4GLS3_LC4G4D4T_POSN                   equ 0007h
CLC4GLS3_LC4G4D4T_POSITION               equ 0007h
CLC4GLS3_LC4G4D4T_SIZE                   equ 0001h
CLC4GLS3_LC4G4D4T_LENGTH                 equ 0001h
CLC4GLS3_LC4G4D4T_MASK                   equ 0080h

// Register: CLC5CON
#define CLC5CON CLC5CON
CLC5CON                                  equ 0E4Fh
// bitfield definitions
CLC5CON_MODE_POSN                        equ 0000h
CLC5CON_MODE_POSITION                    equ 0000h
CLC5CON_MODE_SIZE                        equ 0003h
CLC5CON_MODE_LENGTH                      equ 0003h
CLC5CON_MODE_MASK                        equ 0007h
CLC5CON_INTN_POSN                        equ 0003h
CLC5CON_INTN_POSITION                    equ 0003h
CLC5CON_INTN_SIZE                        equ 0001h
CLC5CON_INTN_LENGTH                      equ 0001h
CLC5CON_INTN_MASK                        equ 0008h
CLC5CON_INTP_POSN                        equ 0004h
CLC5CON_INTP_POSITION                    equ 0004h
CLC5CON_INTP_SIZE                        equ 0001h
CLC5CON_INTP_LENGTH                      equ 0001h
CLC5CON_INTP_MASK                        equ 0010h
CLC5CON_OUT_POSN                         equ 0005h
CLC5CON_OUT_POSITION                     equ 0005h
CLC5CON_OUT_SIZE                         equ 0001h
CLC5CON_OUT_LENGTH                       equ 0001h
CLC5CON_OUT_MASK                         equ 0020h
CLC5CON_EN_POSN                          equ 0007h
CLC5CON_EN_POSITION                      equ 0007h
CLC5CON_EN_SIZE                          equ 0001h
CLC5CON_EN_LENGTH                        equ 0001h
CLC5CON_EN_MASK                          equ 0080h
CLC5CON_MODE0_POSN                       equ 0000h
CLC5CON_MODE0_POSITION                   equ 0000h
CLC5CON_MODE0_SIZE                       equ 0001h
CLC5CON_MODE0_LENGTH                     equ 0001h
CLC5CON_MODE0_MASK                       equ 0001h
CLC5CON_MODE1_POSN                       equ 0001h
CLC5CON_MODE1_POSITION                   equ 0001h
CLC5CON_MODE1_SIZE                       equ 0001h
CLC5CON_MODE1_LENGTH                     equ 0001h
CLC5CON_MODE1_MASK                       equ 0002h
CLC5CON_MODE2_POSN                       equ 0002h
CLC5CON_MODE2_POSITION                   equ 0002h
CLC5CON_MODE2_SIZE                       equ 0001h
CLC5CON_MODE2_LENGTH                     equ 0001h
CLC5CON_MODE2_MASK                       equ 0004h
CLC5CON_LC5MODE_POSN                     equ 0000h
CLC5CON_LC5MODE_POSITION                 equ 0000h
CLC5CON_LC5MODE_SIZE                     equ 0003h
CLC5CON_LC5MODE_LENGTH                   equ 0003h
CLC5CON_LC5MODE_MASK                     equ 0007h
CLC5CON_LC5INTN_POSN                     equ 0003h
CLC5CON_LC5INTN_POSITION                 equ 0003h
CLC5CON_LC5INTN_SIZE                     equ 0001h
CLC5CON_LC5INTN_LENGTH                   equ 0001h
CLC5CON_LC5INTN_MASK                     equ 0008h
CLC5CON_LC5INTP_POSN                     equ 0004h
CLC5CON_LC5INTP_POSITION                 equ 0004h
CLC5CON_LC5INTP_SIZE                     equ 0001h
CLC5CON_LC5INTP_LENGTH                   equ 0001h
CLC5CON_LC5INTP_MASK                     equ 0010h
CLC5CON_LC5OUT_POSN                      equ 0005h
CLC5CON_LC5OUT_POSITION                  equ 0005h
CLC5CON_LC5OUT_SIZE                      equ 0001h
CLC5CON_LC5OUT_LENGTH                    equ 0001h
CLC5CON_LC5OUT_MASK                      equ 0020h
CLC5CON_LC5EN_POSN                       equ 0007h
CLC5CON_LC5EN_POSITION                   equ 0007h
CLC5CON_LC5EN_SIZE                       equ 0001h
CLC5CON_LC5EN_LENGTH                     equ 0001h
CLC5CON_LC5EN_MASK                       equ 0080h
CLC5CON_LC5MODE0_POSN                    equ 0000h
CLC5CON_LC5MODE0_POSITION                equ 0000h
CLC5CON_LC5MODE0_SIZE                    equ 0001h
CLC5CON_LC5MODE0_LENGTH                  equ 0001h
CLC5CON_LC5MODE0_MASK                    equ 0001h
CLC5CON_LC5MODE1_POSN                    equ 0001h
CLC5CON_LC5MODE1_POSITION                equ 0001h
CLC5CON_LC5MODE1_SIZE                    equ 0001h
CLC5CON_LC5MODE1_LENGTH                  equ 0001h
CLC5CON_LC5MODE1_MASK                    equ 0002h
CLC5CON_LC5MODE2_POSN                    equ 0002h
CLC5CON_LC5MODE2_POSITION                equ 0002h
CLC5CON_LC5MODE2_SIZE                    equ 0001h
CLC5CON_LC5MODE2_LENGTH                  equ 0001h
CLC5CON_LC5MODE2_MASK                    equ 0004h

// Register: CLC5POL
#define CLC5POL CLC5POL
CLC5POL                                  equ 0E50h
// bitfield definitions
CLC5POL_G1POL_POSN                       equ 0000h
CLC5POL_G1POL_POSITION                   equ 0000h
CLC5POL_G1POL_SIZE                       equ 0001h
CLC5POL_G1POL_LENGTH                     equ 0001h
CLC5POL_G1POL_MASK                       equ 0001h
CLC5POL_G2POL_POSN                       equ 0001h
CLC5POL_G2POL_POSITION                   equ 0001h
CLC5POL_G2POL_SIZE                       equ 0001h
CLC5POL_G2POL_LENGTH                     equ 0001h
CLC5POL_G2POL_MASK                       equ 0002h
CLC5POL_G3POL_POSN                       equ 0002h
CLC5POL_G3POL_POSITION                   equ 0002h
CLC5POL_G3POL_SIZE                       equ 0001h
CLC5POL_G3POL_LENGTH                     equ 0001h
CLC5POL_G3POL_MASK                       equ 0004h
CLC5POL_G4POL_POSN                       equ 0003h
CLC5POL_G4POL_POSITION                   equ 0003h
CLC5POL_G4POL_SIZE                       equ 0001h
CLC5POL_G4POL_LENGTH                     equ 0001h
CLC5POL_G4POL_MASK                       equ 0008h
CLC5POL_POL_POSN                         equ 0007h
CLC5POL_POL_POSITION                     equ 0007h
CLC5POL_POL_SIZE                         equ 0001h
CLC5POL_POL_LENGTH                       equ 0001h
CLC5POL_POL_MASK                         equ 0080h
CLC5POL_LC5G1POL_POSN                    equ 0000h
CLC5POL_LC5G1POL_POSITION                equ 0000h
CLC5POL_LC5G1POL_SIZE                    equ 0001h
CLC5POL_LC5G1POL_LENGTH                  equ 0001h
CLC5POL_LC5G1POL_MASK                    equ 0001h
CLC5POL_LC5G2POL_POSN                    equ 0001h
CLC5POL_LC5G2POL_POSITION                equ 0001h
CLC5POL_LC5G2POL_SIZE                    equ 0001h
CLC5POL_LC5G2POL_LENGTH                  equ 0001h
CLC5POL_LC5G2POL_MASK                    equ 0002h
CLC5POL_LC5G3POL_POSN                    equ 0002h
CLC5POL_LC5G3POL_POSITION                equ 0002h
CLC5POL_LC5G3POL_SIZE                    equ 0001h
CLC5POL_LC5G3POL_LENGTH                  equ 0001h
CLC5POL_LC5G3POL_MASK                    equ 0004h
CLC5POL_LC5G4POL_POSN                    equ 0003h
CLC5POL_LC5G4POL_POSITION                equ 0003h
CLC5POL_LC5G4POL_SIZE                    equ 0001h
CLC5POL_LC5G4POL_LENGTH                  equ 0001h
CLC5POL_LC5G4POL_MASK                    equ 0008h
CLC5POL_LC5POL_POSN                      equ 0007h
CLC5POL_LC5POL_POSITION                  equ 0007h
CLC5POL_LC5POL_SIZE                      equ 0001h
CLC5POL_LC5POL_LENGTH                    equ 0001h
CLC5POL_LC5POL_MASK                      equ 0080h

// Register: CLC5SEL0
#define CLC5SEL0 CLC5SEL0
CLC5SEL0                                 equ 0E51h
// bitfield definitions
CLC5SEL0_D1S_POSN                        equ 0000h
CLC5SEL0_D1S_POSITION                    equ 0000h
CLC5SEL0_D1S_SIZE                        equ 0008h
CLC5SEL0_D1S_LENGTH                      equ 0008h
CLC5SEL0_D1S_MASK                        equ 00FFh
CLC5SEL0_LC5D1S_POSN                     equ 0000h
CLC5SEL0_LC5D1S_POSITION                 equ 0000h
CLC5SEL0_LC5D1S_SIZE                     equ 0008h
CLC5SEL0_LC5D1S_LENGTH                   equ 0008h
CLC5SEL0_LC5D1S_MASK                     equ 00FFh
CLC5SEL0_D1S0_POSN                       equ 0000h
CLC5SEL0_D1S0_POSITION                   equ 0000h
CLC5SEL0_D1S0_SIZE                       equ 0001h
CLC5SEL0_D1S0_LENGTH                     equ 0001h
CLC5SEL0_D1S0_MASK                       equ 0001h
CLC5SEL0_D1S1_POSN                       equ 0001h
CLC5SEL0_D1S1_POSITION                   equ 0001h
CLC5SEL0_D1S1_SIZE                       equ 0001h
CLC5SEL0_D1S1_LENGTH                     equ 0001h
CLC5SEL0_D1S1_MASK                       equ 0002h
CLC5SEL0_D1S2_POSN                       equ 0002h
CLC5SEL0_D1S2_POSITION                   equ 0002h
CLC5SEL0_D1S2_SIZE                       equ 0001h
CLC5SEL0_D1S2_LENGTH                     equ 0001h
CLC5SEL0_D1S2_MASK                       equ 0004h
CLC5SEL0_D1S3_POSN                       equ 0003h
CLC5SEL0_D1S3_POSITION                   equ 0003h
CLC5SEL0_D1S3_SIZE                       equ 0001h
CLC5SEL0_D1S3_LENGTH                     equ 0001h
CLC5SEL0_D1S3_MASK                       equ 0008h
CLC5SEL0_D1S4_POSN                       equ 0004h
CLC5SEL0_D1S4_POSITION                   equ 0004h
CLC5SEL0_D1S4_SIZE                       equ 0001h
CLC5SEL0_D1S4_LENGTH                     equ 0001h
CLC5SEL0_D1S4_MASK                       equ 0010h
CLC5SEL0_D1S5_POSN                       equ 0005h
CLC5SEL0_D1S5_POSITION                   equ 0005h
CLC5SEL0_D1S5_SIZE                       equ 0001h
CLC5SEL0_D1S5_LENGTH                     equ 0001h
CLC5SEL0_D1S5_MASK                       equ 0020h
CLC5SEL0_D1S6_POSN                       equ 0006h
CLC5SEL0_D1S6_POSITION                   equ 0006h
CLC5SEL0_D1S6_SIZE                       equ 0001h
CLC5SEL0_D1S6_LENGTH                     equ 0001h
CLC5SEL0_D1S6_MASK                       equ 0040h
CLC5SEL0_D1S7_POSN                       equ 0007h
CLC5SEL0_D1S7_POSITION                   equ 0007h
CLC5SEL0_D1S7_SIZE                       equ 0001h
CLC5SEL0_D1S7_LENGTH                     equ 0001h
CLC5SEL0_D1S7_MASK                       equ 0080h
CLC5SEL0_LC5D1S0_POSN                    equ 0000h
CLC5SEL0_LC5D1S0_POSITION                equ 0000h
CLC5SEL0_LC5D1S0_SIZE                    equ 0001h
CLC5SEL0_LC5D1S0_LENGTH                  equ 0001h
CLC5SEL0_LC5D1S0_MASK                    equ 0001h
CLC5SEL0_LC5D1S1_POSN                    equ 0001h
CLC5SEL0_LC5D1S1_POSITION                equ 0001h
CLC5SEL0_LC5D1S1_SIZE                    equ 0001h
CLC5SEL0_LC5D1S1_LENGTH                  equ 0001h
CLC5SEL0_LC5D1S1_MASK                    equ 0002h
CLC5SEL0_LC5D1S2_POSN                    equ 0002h
CLC5SEL0_LC5D1S2_POSITION                equ 0002h
CLC5SEL0_LC5D1S2_SIZE                    equ 0001h
CLC5SEL0_LC5D1S2_LENGTH                  equ 0001h
CLC5SEL0_LC5D1S2_MASK                    equ 0004h
CLC5SEL0_LC5D1S3_POSN                    equ 0003h
CLC5SEL0_LC5D1S3_POSITION                equ 0003h
CLC5SEL0_LC5D1S3_SIZE                    equ 0001h
CLC5SEL0_LC5D1S3_LENGTH                  equ 0001h
CLC5SEL0_LC5D1S3_MASK                    equ 0008h
CLC5SEL0_LC5D1S4_POSN                    equ 0004h
CLC5SEL0_LC5D1S4_POSITION                equ 0004h
CLC5SEL0_LC5D1S4_SIZE                    equ 0001h
CLC5SEL0_LC5D1S4_LENGTH                  equ 0001h
CLC5SEL0_LC5D1S4_MASK                    equ 0010h
CLC5SEL0_LC5D1S5_POSN                    equ 0005h
CLC5SEL0_LC5D1S5_POSITION                equ 0005h
CLC5SEL0_LC5D1S5_SIZE                    equ 0001h
CLC5SEL0_LC5D1S5_LENGTH                  equ 0001h
CLC5SEL0_LC5D1S5_MASK                    equ 0020h
CLC5SEL0_LC5D1S6_POSN                    equ 0006h
CLC5SEL0_LC5D1S6_POSITION                equ 0006h
CLC5SEL0_LC5D1S6_SIZE                    equ 0001h
CLC5SEL0_LC5D1S6_LENGTH                  equ 0001h
CLC5SEL0_LC5D1S6_MASK                    equ 0040h
CLC5SEL0_LC5D1S7_POSN                    equ 0007h
CLC5SEL0_LC5D1S7_POSITION                equ 0007h
CLC5SEL0_LC5D1S7_SIZE                    equ 0001h
CLC5SEL0_LC5D1S7_LENGTH                  equ 0001h
CLC5SEL0_LC5D1S7_MASK                    equ 0080h

