GopalSaraf/Practicals/PSDL/include/proc/pic18f45q10.inc
// Register: CLC6GLS0
#define CLC6GLS0 CLC6GLS0
CLC6GLS0                                 equ 0E5Fh
// bitfield definitions
CLC6GLS0_G1D1N_POSN                      equ 0000h
CLC6GLS0_G1D1N_POSITION                  equ 0000h
CLC6GLS0_G1D1N_SIZE                      equ 0001h
CLC6GLS0_G1D1N_LENGTH                    equ 0001h
CLC6GLS0_G1D1N_MASK                      equ 0001h
CLC6GLS0_G1D1T_POSN                      equ 0001h
CLC6GLS0_G1D1T_POSITION                  equ 0001h
CLC6GLS0_G1D1T_SIZE                      equ 0001h
CLC6GLS0_G1D1T_LENGTH                    equ 0001h
CLC6GLS0_G1D1T_MASK                      equ 0002h
CLC6GLS0_G1D2N_POSN                      equ 0002h
CLC6GLS0_G1D2N_POSITION                  equ 0002h
CLC6GLS0_G1D2N_SIZE                      equ 0001h
CLC6GLS0_G1D2N_LENGTH                    equ 0001h
CLC6GLS0_G1D2N_MASK                      equ 0004h
CLC6GLS0_G1D2T_POSN                      equ 0003h
CLC6GLS0_G1D2T_POSITION                  equ 0003h
CLC6GLS0_G1D2T_SIZE                      equ 0001h
CLC6GLS0_G1D2T_LENGTH                    equ 0001h
CLC6GLS0_G1D2T_MASK                      equ 0008h
CLC6GLS0_G1D3N_POSN                      equ 0004h
CLC6GLS0_G1D3N_POSITION                  equ 0004h
CLC6GLS0_G1D3N_SIZE                      equ 0001h
CLC6GLS0_G1D3N_LENGTH                    equ 0001h
CLC6GLS0_G1D3N_MASK                      equ 0010h
CLC6GLS0_G1D3T_POSN                      equ 0005h
CLC6GLS0_G1D3T_POSITION                  equ 0005h
CLC6GLS0_G1D3T_SIZE                      equ 0001h
CLC6GLS0_G1D3T_LENGTH                    equ 0001h
CLC6GLS0_G1D3T_MASK                      equ 0020h
CLC6GLS0_G1D4N_POSN                      equ 0006h
CLC6GLS0_G1D4N_POSITION                  equ 0006h
CLC6GLS0_G1D4N_SIZE                      equ 0001h
CLC6GLS0_G1D4N_LENGTH                    equ 0001h
CLC6GLS0_G1D4N_MASK                      equ 0040h
CLC6GLS0_G1D4T_POSN                      equ 0007h
CLC6GLS0_G1D4T_POSITION                  equ 0007h
CLC6GLS0_G1D4T_SIZE                      equ 0001h
CLC6GLS0_G1D4T_LENGTH                    equ 0001h
CLC6GLS0_G1D4T_MASK                      equ 0080h
CLC6GLS0_LC6G1D1N_POSN                   equ 0000h
CLC6GLS0_LC6G1D1N_POSITION               equ 0000h
CLC6GLS0_LC6G1D1N_SIZE                   equ 0001h
CLC6GLS0_LC6G1D1N_LENGTH                 equ 0001h
CLC6GLS0_LC6G1D1N_MASK                   equ 0001h
CLC6GLS0_LC6G1D1T_POSN                   equ 0001h
CLC6GLS0_LC6G1D1T_POSITION               equ 0001h
CLC6GLS0_LC6G1D1T_SIZE                   equ 0001h
CLC6GLS0_LC6G1D1T_LENGTH                 equ 0001h
CLC6GLS0_LC6G1D1T_MASK                   equ 0002h
CLC6GLS0_LC6G1D2N_POSN                   equ 0002h
CLC6GLS0_LC6G1D2N_POSITION               equ 0002h
CLC6GLS0_LC6G1D2N_SIZE                   equ 0001h
CLC6GLS0_LC6G1D2N_LENGTH                 equ 0001h
CLC6GLS0_LC6G1D2N_MASK                   equ 0004h
CLC6GLS0_LC6G1D2T_POSN                   equ 0003h
CLC6GLS0_LC6G1D2T_POSITION               equ 0003h
CLC6GLS0_LC6G1D2T_SIZE                   equ 0001h
CLC6GLS0_LC6G1D2T_LENGTH                 equ 0001h
CLC6GLS0_LC6G1D2T_MASK                   equ 0008h
CLC6GLS0_LC6G1D3N_POSN                   equ 0004h
CLC6GLS0_LC6G1D3N_POSITION               equ 0004h
CLC6GLS0_LC6G1D3N_SIZE                   equ 0001h
CLC6GLS0_LC6G1D3N_LENGTH                 equ 0001h
CLC6GLS0_LC6G1D3N_MASK                   equ 0010h
CLC6GLS0_LC6G1D3T_POSN                   equ 0005h
CLC6GLS0_LC6G1D3T_POSITION               equ 0005h
CLC6GLS0_LC6G1D3T_SIZE                   equ 0001h
CLC6GLS0_LC6G1D3T_LENGTH                 equ 0001h
CLC6GLS0_LC6G1D3T_MASK                   equ 0020h
CLC6GLS0_LC6G1D4N_POSN                   equ 0006h
CLC6GLS0_LC6G1D4N_POSITION               equ 0006h
CLC6GLS0_LC6G1D4N_SIZE                   equ 0001h
CLC6GLS0_LC6G1D4N_LENGTH                 equ 0001h
CLC6GLS0_LC6G1D4N_MASK                   equ 0040h
CLC6GLS0_LC6G1D4T_POSN                   equ 0007h
CLC6GLS0_LC6G1D4T_POSITION               equ 0007h
CLC6GLS0_LC6G1D4T_SIZE                   equ 0001h
CLC6GLS0_LC6G1D4T_LENGTH                 equ 0001h
CLC6GLS0_LC6G1D4T_MASK                   equ 0080h

// Register: CLC6GLS1
#define CLC6GLS1 CLC6GLS1
CLC6GLS1                                 equ 0E60h
// bitfield definitions
CLC6GLS1_G2D1N_POSN                      equ 0000h
CLC6GLS1_G2D1N_POSITION                  equ 0000h
CLC6GLS1_G2D1N_SIZE                      equ 0001h
CLC6GLS1_G2D1N_LENGTH                    equ 0001h
CLC6GLS1_G2D1N_MASK                      equ 0001h
CLC6GLS1_G2D1T_POSN                      equ 0001h
CLC6GLS1_G2D1T_POSITION                  equ 0001h
CLC6GLS1_G2D1T_SIZE                      equ 0001h
CLC6GLS1_G2D1T_LENGTH                    equ 0001h
CLC6GLS1_G2D1T_MASK                      equ 0002h
CLC6GLS1_G2D2N_POSN                      equ 0002h
CLC6GLS1_G2D2N_POSITION                  equ 0002h
CLC6GLS1_G2D2N_SIZE                      equ 0001h
CLC6GLS1_G2D2N_LENGTH                    equ 0001h
CLC6GLS1_G2D2N_MASK                      equ 0004h
CLC6GLS1_G2D2T_POSN                      equ 0003h
CLC6GLS1_G2D2T_POSITION                  equ 0003h
CLC6GLS1_G2D2T_SIZE                      equ 0001h
CLC6GLS1_G2D2T_LENGTH                    equ 0001h
CLC6GLS1_G2D2T_MASK                      equ 0008h
CLC6GLS1_G2D3N_POSN                      equ 0004h
CLC6GLS1_G2D3N_POSITION                  equ 0004h
CLC6GLS1_G2D3N_SIZE                      equ 0001h
CLC6GLS1_G2D3N_LENGTH                    equ 0001h
CLC6GLS1_G2D3N_MASK                      equ 0010h
CLC6GLS1_G2D3T_POSN                      equ 0005h
CLC6GLS1_G2D3T_POSITION                  equ 0005h
CLC6GLS1_G2D3T_SIZE                      equ 0001h
CLC6GLS1_G2D3T_LENGTH                    equ 0001h
CLC6GLS1_G2D3T_MASK                      equ 0020h
CLC6GLS1_G2D4N_POSN                      equ 0006h
CLC6GLS1_G2D4N_POSITION                  equ 0006h
CLC6GLS1_G2D4N_SIZE                      equ 0001h
CLC6GLS1_G2D4N_LENGTH                    equ 0001h
CLC6GLS1_G2D4N_MASK                      equ 0040h
CLC6GLS1_G2D4T_POSN                      equ 0007h
CLC6GLS1_G2D4T_POSITION                  equ 0007h
CLC6GLS1_G2D4T_SIZE                      equ 0001h
CLC6GLS1_G2D4T_LENGTH                    equ 0001h
CLC6GLS1_G2D4T_MASK                      equ 0080h
CLC6GLS1_LC6G2D1N_POSN                   equ 0000h
CLC6GLS1_LC6G2D1N_POSITION               equ 0000h
CLC6GLS1_LC6G2D1N_SIZE                   equ 0001h
CLC6GLS1_LC6G2D1N_LENGTH                 equ 0001h
CLC6GLS1_LC6G2D1N_MASK                   equ 0001h
CLC6GLS1_LC6G2D1T_POSN                   equ 0001h
CLC6GLS1_LC6G2D1T_POSITION               equ 0001h
CLC6GLS1_LC6G2D1T_SIZE                   equ 0001h
CLC6GLS1_LC6G2D1T_LENGTH                 equ 0001h
CLC6GLS1_LC6G2D1T_MASK                   equ 0002h
CLC6GLS1_LC6G2D2N_POSN                   equ 0002h
CLC6GLS1_LC6G2D2N_POSITION               equ 0002h
CLC6GLS1_LC6G2D2N_SIZE                   equ 0001h
CLC6GLS1_LC6G2D2N_LENGTH                 equ 0001h
CLC6GLS1_LC6G2D2N_MASK                   equ 0004h
CLC6GLS1_LC6G2D2T_POSN                   equ 0003h
CLC6GLS1_LC6G2D2T_POSITION               equ 0003h
CLC6GLS1_LC6G2D2T_SIZE                   equ 0001h
CLC6GLS1_LC6G2D2T_LENGTH                 equ 0001h
CLC6GLS1_LC6G2D2T_MASK                   equ 0008h
CLC6GLS1_LC6G2D3N_POSN                   equ 0004h
CLC6GLS1_LC6G2D3N_POSITION               equ 0004h
CLC6GLS1_LC6G2D3N_SIZE                   equ 0001h
CLC6GLS1_LC6G2D3N_LENGTH                 equ 0001h
CLC6GLS1_LC6G2D3N_MASK                   equ 0010h
CLC6GLS1_LC6G2D3T_POSN                   equ 0005h
CLC6GLS1_LC6G2D3T_POSITION               equ 0005h
CLC6GLS1_LC6G2D3T_SIZE                   equ 0001h
CLC6GLS1_LC6G2D3T_LENGTH                 equ 0001h
CLC6GLS1_LC6G2D3T_MASK                   equ 0020h
CLC6GLS1_LC6G2D4N_POSN                   equ 0006h
CLC6GLS1_LC6G2D4N_POSITION               equ 0006h
CLC6GLS1_LC6G2D4N_SIZE                   equ 0001h
CLC6GLS1_LC6G2D4N_LENGTH                 equ 0001h
CLC6GLS1_LC6G2D4N_MASK                   equ 0040h
CLC6GLS1_LC6G2D4T_POSN                   equ 0007h
CLC6GLS1_LC6G2D4T_POSITION               equ 0007h
CLC6GLS1_LC6G2D4T_SIZE                   equ 0001h
CLC6GLS1_LC6G2D4T_LENGTH                 equ 0001h
CLC6GLS1_LC6G2D4T_MASK                   equ 0080h

