GopalSaraf/Practicals/PSDL/include/proc/pic18f45q10.inc
// Register: CLC8SEL0
#define CLC8SEL0 CLC8SEL0
CLC8SEL0                                 equ 0E6Fh
// bitfield definitions
CLC8SEL0_D1S_POSN                        equ 0000h
CLC8SEL0_D1S_POSITION                    equ 0000h
CLC8SEL0_D1S_SIZE                        equ 0008h
CLC8SEL0_D1S_LENGTH                      equ 0008h
CLC8SEL0_D1S_MASK                        equ 00FFh
CLC8SEL0_LC8D1S_POSN                     equ 0000h
CLC8SEL0_LC8D1S_POSITION                 equ 0000h
CLC8SEL0_LC8D1S_SIZE                     equ 0008h
CLC8SEL0_LC8D1S_LENGTH                   equ 0008h
CLC8SEL0_LC8D1S_MASK                     equ 00FFh
CLC8SEL0_D1S0_POSN                       equ 0000h
CLC8SEL0_D1S0_POSITION                   equ 0000h
CLC8SEL0_D1S0_SIZE                       equ 0001h
CLC8SEL0_D1S0_LENGTH                     equ 0001h
CLC8SEL0_D1S0_MASK                       equ 0001h
CLC8SEL0_D1S1_POSN                       equ 0001h
CLC8SEL0_D1S1_POSITION                   equ 0001h
CLC8SEL0_D1S1_SIZE                       equ 0001h
CLC8SEL0_D1S1_LENGTH                     equ 0001h
CLC8SEL0_D1S1_MASK                       equ 0002h
CLC8SEL0_D1S2_POSN                       equ 0002h
CLC8SEL0_D1S2_POSITION                   equ 0002h
CLC8SEL0_D1S2_SIZE                       equ 0001h
CLC8SEL0_D1S2_LENGTH                     equ 0001h
CLC8SEL0_D1S2_MASK                       equ 0004h
CLC8SEL0_D1S3_POSN                       equ 0003h
CLC8SEL0_D1S3_POSITION                   equ 0003h
CLC8SEL0_D1S3_SIZE                       equ 0001h
CLC8SEL0_D1S3_LENGTH                     equ 0001h
CLC8SEL0_D1S3_MASK                       equ 0008h
CLC8SEL0_D1S4_POSN                       equ 0004h
CLC8SEL0_D1S4_POSITION                   equ 0004h
CLC8SEL0_D1S4_SIZE                       equ 0001h
CLC8SEL0_D1S4_LENGTH                     equ 0001h
CLC8SEL0_D1S4_MASK                       equ 0010h
CLC8SEL0_D1S5_POSN                       equ 0005h
CLC8SEL0_D1S5_POSITION                   equ 0005h
CLC8SEL0_D1S5_SIZE                       equ 0001h
CLC8SEL0_D1S5_LENGTH                     equ 0001h
CLC8SEL0_D1S5_MASK                       equ 0020h
CLC8SEL0_D1S6_POSN                       equ 0006h
CLC8SEL0_D1S6_POSITION                   equ 0006h
CLC8SEL0_D1S6_SIZE                       equ 0001h
CLC8SEL0_D1S6_LENGTH                     equ 0001h
CLC8SEL0_D1S6_MASK                       equ 0040h
CLC8SEL0_D1S7_POSN                       equ 0007h
CLC8SEL0_D1S7_POSITION                   equ 0007h
CLC8SEL0_D1S7_SIZE                       equ 0001h
CLC8SEL0_D1S7_LENGTH                     equ 0001h
CLC8SEL0_D1S7_MASK                       equ 0080h
CLC8SEL0_LC8D1S0_POSN                    equ 0000h
CLC8SEL0_LC8D1S0_POSITION                equ 0000h
CLC8SEL0_LC8D1S0_SIZE                    equ 0001h
CLC8SEL0_LC8D1S0_LENGTH                  equ 0001h
CLC8SEL0_LC8D1S0_MASK                    equ 0001h
CLC8SEL0_LC8D1S1_POSN                    equ 0001h
CLC8SEL0_LC8D1S1_POSITION                equ 0001h
CLC8SEL0_LC8D1S1_SIZE                    equ 0001h
CLC8SEL0_LC8D1S1_LENGTH                  equ 0001h
CLC8SEL0_LC8D1S1_MASK                    equ 0002h
CLC8SEL0_LC8D1S2_POSN                    equ 0002h
CLC8SEL0_LC8D1S2_POSITION                equ 0002h
CLC8SEL0_LC8D1S2_SIZE                    equ 0001h
CLC8SEL0_LC8D1S2_LENGTH                  equ 0001h
CLC8SEL0_LC8D1S2_MASK                    equ 0004h
CLC8SEL0_LC8D1S3_POSN                    equ 0003h
CLC8SEL0_LC8D1S3_POSITION                equ 0003h
CLC8SEL0_LC8D1S3_SIZE                    equ 0001h
CLC8SEL0_LC8D1S3_LENGTH                  equ 0001h
CLC8SEL0_LC8D1S3_MASK                    equ 0008h
CLC8SEL0_LC8D1S4_POSN                    equ 0004h
CLC8SEL0_LC8D1S4_POSITION                equ 0004h
CLC8SEL0_LC8D1S4_SIZE                    equ 0001h
CLC8SEL0_LC8D1S4_LENGTH                  equ 0001h
CLC8SEL0_LC8D1S4_MASK                    equ 0010h
CLC8SEL0_LC8D1S5_POSN                    equ 0005h
CLC8SEL0_LC8D1S5_POSITION                equ 0005h
CLC8SEL0_LC8D1S5_SIZE                    equ 0001h
CLC8SEL0_LC8D1S5_LENGTH                  equ 0001h
CLC8SEL0_LC8D1S5_MASK                    equ 0020h
CLC8SEL0_LC8D1S6_POSN                    equ 0006h
CLC8SEL0_LC8D1S6_POSITION                equ 0006h
CLC8SEL0_LC8D1S6_SIZE                    equ 0001h
CLC8SEL0_LC8D1S6_LENGTH                  equ 0001h
CLC8SEL0_LC8D1S6_MASK                    equ 0040h
CLC8SEL0_LC8D1S7_POSN                    equ 0007h
CLC8SEL0_LC8D1S7_POSITION                equ 0007h
CLC8SEL0_LC8D1S7_SIZE                    equ 0001h
CLC8SEL0_LC8D1S7_LENGTH                  equ 0001h
CLC8SEL0_LC8D1S7_MASK                    equ 0080h

// Register: CLC8SEL1
#define CLC8SEL1 CLC8SEL1
CLC8SEL1                                 equ 0E70h
// bitfield definitions
CLC8SEL1_D2S_POSN                        equ 0000h
CLC8SEL1_D2S_POSITION                    equ 0000h
CLC8SEL1_D2S_SIZE                        equ 0008h
CLC8SEL1_D2S_LENGTH                      equ 0008h
CLC8SEL1_D2S_MASK                        equ 00FFh
CLC8SEL1_LC8D2S_POSN                     equ 0000h
CLC8SEL1_LC8D2S_POSITION                 equ 0000h
CLC8SEL1_LC8D2S_SIZE                     equ 0008h
CLC8SEL1_LC8D2S_LENGTH                   equ 0008h
CLC8SEL1_LC8D2S_MASK                     equ 00FFh
CLC8SEL1_D2S0_POSN                       equ 0000h
CLC8SEL1_D2S0_POSITION                   equ 0000h
CLC8SEL1_D2S0_SIZE                       equ 0001h
CLC8SEL1_D2S0_LENGTH                     equ 0001h
CLC8SEL1_D2S0_MASK                       equ 0001h
CLC8SEL1_D2S1_POSN                       equ 0001h
CLC8SEL1_D2S1_POSITION                   equ 0001h
CLC8SEL1_D2S1_SIZE                       equ 0001h
CLC8SEL1_D2S1_LENGTH                     equ 0001h
CLC8SEL1_D2S1_MASK                       equ 0002h
CLC8SEL1_D2S2_POSN                       equ 0002h
CLC8SEL1_D2S2_POSITION                   equ 0002h
CLC8SEL1_D2S2_SIZE                       equ 0001h
CLC8SEL1_D2S2_LENGTH                     equ 0001h
CLC8SEL1_D2S2_MASK                       equ 0004h
CLC8SEL1_D2S3_POSN                       equ 0003h
CLC8SEL1_D2S3_POSITION                   equ 0003h
CLC8SEL1_D2S3_SIZE                       equ 0001h
CLC8SEL1_D2S3_LENGTH                     equ 0001h
CLC8SEL1_D2S3_MASK                       equ 0008h
CLC8SEL1_D2S4_POSN                       equ 0004h
CLC8SEL1_D2S4_POSITION                   equ 0004h
CLC8SEL1_D2S4_SIZE                       equ 0001h
CLC8SEL1_D2S4_LENGTH                     equ 0001h
CLC8SEL1_D2S4_MASK                       equ 0010h
CLC8SEL1_D2S5_POSN                       equ 0005h
CLC8SEL1_D2S5_POSITION                   equ 0005h
CLC8SEL1_D2S5_SIZE                       equ 0001h
CLC8SEL1_D2S5_LENGTH                     equ 0001h
CLC8SEL1_D2S5_MASK                       equ 0020h
CLC8SEL1_D2S6_POSN                       equ 0006h
CLC8SEL1_D2S6_POSITION                   equ 0006h
CLC8SEL1_D2S6_SIZE                       equ 0001h
CLC8SEL1_D2S6_LENGTH                     equ 0001h
CLC8SEL1_D2S6_MASK                       equ 0040h
CLC8SEL1_D2S7_POSN                       equ 0007h
CLC8SEL1_D2S7_POSITION                   equ 0007h
CLC8SEL1_D2S7_SIZE                       equ 0001h
CLC8SEL1_D2S7_LENGTH                     equ 0001h
CLC8SEL1_D2S7_MASK                       equ 0080h
CLC8SEL1_LC8D2S0_POSN                    equ 0000h
CLC8SEL1_LC8D2S0_POSITION                equ 0000h
CLC8SEL1_LC8D2S0_SIZE                    equ 0001h
CLC8SEL1_LC8D2S0_LENGTH                  equ 0001h
CLC8SEL1_LC8D2S0_MASK                    equ 0001h
CLC8SEL1_LC8D2S1_POSN                    equ 0001h
CLC8SEL1_LC8D2S1_POSITION                equ 0001h
CLC8SEL1_LC8D2S1_SIZE                    equ 0001h
CLC8SEL1_LC8D2S1_LENGTH                  equ 0001h
CLC8SEL1_LC8D2S1_MASK                    equ 0002h
CLC8SEL1_LC8D2S2_POSN                    equ 0002h
CLC8SEL1_LC8D2S2_POSITION                equ 0002h
CLC8SEL1_LC8D2S2_SIZE                    equ 0001h
CLC8SEL1_LC8D2S2_LENGTH                  equ 0001h
CLC8SEL1_LC8D2S2_MASK                    equ 0004h
CLC8SEL1_LC8D2S3_POSN                    equ 0003h
CLC8SEL1_LC8D2S3_POSITION                equ 0003h
CLC8SEL1_LC8D2S3_SIZE                    equ 0001h
CLC8SEL1_LC8D2S3_LENGTH                  equ 0001h
CLC8SEL1_LC8D2S3_MASK                    equ 0008h
CLC8SEL1_LC8D2S4_POSN                    equ 0004h
CLC8SEL1_LC8D2S4_POSITION                equ 0004h
CLC8SEL1_LC8D2S4_SIZE                    equ 0001h
CLC8SEL1_LC8D2S4_LENGTH                  equ 0001h
CLC8SEL1_LC8D2S4_MASK                    equ 0010h
CLC8SEL1_LC8D2S5_POSN                    equ 0005h
CLC8SEL1_LC8D2S5_POSITION                equ 0005h
CLC8SEL1_LC8D2S5_SIZE                    equ 0001h
CLC8SEL1_LC8D2S5_LENGTH                  equ 0001h
CLC8SEL1_LC8D2S5_MASK                    equ 0020h
CLC8SEL1_LC8D2S6_POSN                    equ 0006h
CLC8SEL1_LC8D2S6_POSITION                equ 0006h
CLC8SEL1_LC8D2S6_SIZE                    equ 0001h
CLC8SEL1_LC8D2S6_LENGTH                  equ 0001h
CLC8SEL1_LC8D2S6_MASK                    equ 0040h
CLC8SEL1_LC8D2S7_POSN                    equ 0007h
CLC8SEL1_LC8D2S7_POSITION                equ 0007h
CLC8SEL1_LC8D2S7_SIZE                    equ 0001h
CLC8SEL1_LC8D2S7_LENGTH                  equ 0001h
CLC8SEL1_LC8D2S7_MASK                    equ 0080h

