GopalSaraf/Practicals/PSDL/include/proc/pic18f45q10.inc
// Register: IOCEF
#define IOCEF IOCEF
IOCEF                                    equ 0F22h
// bitfield definitions
IOCEF_IOCEF0_POSN                        equ 0000h
IOCEF_IOCEF0_POSITION                    equ 0000h
IOCEF_IOCEF0_SIZE                        equ 0001h
IOCEF_IOCEF0_LENGTH                      equ 0001h
IOCEF_IOCEF0_MASK                        equ 0001h
IOCEF_IOCEF1_POSN                        equ 0001h
IOCEF_IOCEF1_POSITION                    equ 0001h
IOCEF_IOCEF1_SIZE                        equ 0001h
IOCEF_IOCEF1_LENGTH                      equ 0001h
IOCEF_IOCEF1_MASK                        equ 0002h
IOCEF_IOCEF2_POSN                        equ 0002h
IOCEF_IOCEF2_POSITION                    equ 0002h
IOCEF_IOCEF2_SIZE                        equ 0001h
IOCEF_IOCEF2_LENGTH                      equ 0001h
IOCEF_IOCEF2_MASK                        equ 0004h
IOCEF_IOCEF3_POSN                        equ 0003h
IOCEF_IOCEF3_POSITION                    equ 0003h
IOCEF_IOCEF3_SIZE                        equ 0001h
IOCEF_IOCEF3_LENGTH                      equ 0001h
IOCEF_IOCEF3_MASK                        equ 0008h

// Register: IOCEN
#define IOCEN IOCEN
IOCEN                                    equ 0F23h
// bitfield definitions
IOCEN_IOCEN0_POSN                        equ 0000h
IOCEN_IOCEN0_POSITION                    equ 0000h
IOCEN_IOCEN0_SIZE                        equ 0001h
IOCEN_IOCEN0_LENGTH                      equ 0001h
IOCEN_IOCEN0_MASK                        equ 0001h
IOCEN_IOCEN1_POSN                        equ 0001h
IOCEN_IOCEN1_POSITION                    equ 0001h
IOCEN_IOCEN1_SIZE                        equ 0001h
IOCEN_IOCEN1_LENGTH                      equ 0001h
IOCEN_IOCEN1_MASK                        equ 0002h
IOCEN_IOCEN2_POSN                        equ 0002h
IOCEN_IOCEN2_POSITION                    equ 0002h
IOCEN_IOCEN2_SIZE                        equ 0001h
IOCEN_IOCEN2_LENGTH                      equ 0001h
IOCEN_IOCEN2_MASK                        equ 0004h
IOCEN_IOCEN3_POSN                        equ 0003h
IOCEN_IOCEN3_POSITION                    equ 0003h
IOCEN_IOCEN3_SIZE                        equ 0001h
IOCEN_IOCEN3_LENGTH                      equ 0001h
IOCEN_IOCEN3_MASK                        equ 0008h

// Register: IOCEP
#define IOCEP IOCEP
IOCEP                                    equ 0F24h
// bitfield definitions
IOCEP_IOCEP0_POSN                        equ 0000h
IOCEP_IOCEP0_POSITION                    equ 0000h
IOCEP_IOCEP0_SIZE                        equ 0001h
IOCEP_IOCEP0_LENGTH                      equ 0001h
IOCEP_IOCEP0_MASK                        equ 0001h
IOCEP_IOCEP1_POSN                        equ 0001h
IOCEP_IOCEP1_POSITION                    equ 0001h
IOCEP_IOCEP1_SIZE                        equ 0001h
IOCEP_IOCEP1_LENGTH                      equ 0001h
IOCEP_IOCEP1_MASK                        equ 0002h
IOCEP_IOCEP2_POSN                        equ 0002h
IOCEP_IOCEP2_POSITION                    equ 0002h
IOCEP_IOCEP2_SIZE                        equ 0001h
IOCEP_IOCEP2_LENGTH                      equ 0001h
IOCEP_IOCEP2_MASK                        equ 0004h
IOCEP_IOCEP3_POSN                        equ 0003h
IOCEP_IOCEP3_POSITION                    equ 0003h
IOCEP_IOCEP3_SIZE                        equ 0001h
IOCEP_IOCEP3_LENGTH                      equ 0001h
IOCEP_IOCEP3_MASK                        equ 0008h

// Register: INLVLE
#define INLVLE INLVLE
INLVLE                                   equ 0F25h
// bitfield definitions
INLVLE_INLVLE0_POSN                      equ 0000h
INLVLE_INLVLE0_POSITION                  equ 0000h
INLVLE_INLVLE0_SIZE                      equ 0001h
INLVLE_INLVLE0_LENGTH                    equ 0001h
INLVLE_INLVLE0_MASK                      equ 0001h
INLVLE_INLVLE1_POSN                      equ 0001h
INLVLE_INLVLE1_POSITION                  equ 0001h
INLVLE_INLVLE1_SIZE                      equ 0001h
INLVLE_INLVLE1_LENGTH                    equ 0001h
INLVLE_INLVLE1_MASK                      equ 0002h
INLVLE_INLVLE2_POSN                      equ 0002h
INLVLE_INLVLE2_POSITION                  equ 0002h
INLVLE_INLVLE2_SIZE                      equ 0001h
INLVLE_INLVLE2_LENGTH                    equ 0001h
INLVLE_INLVLE2_MASK                      equ 0004h
INLVLE_INLVLE3_POSN                      equ 0003h
INLVLE_INLVLE3_POSITION                  equ 0003h
INLVLE_INLVLE3_SIZE                      equ 0001h
INLVLE_INLVLE3_LENGTH                    equ 0001h
INLVLE_INLVLE3_MASK                      equ 0008h

// Register: SLRCONE
#define SLRCONE SLRCONE
SLRCONE                                  equ 0F26h
// bitfield definitions
SLRCONE_SLRE0_POSN                       equ 0000h
SLRCONE_SLRE0_POSITION                   equ 0000h
SLRCONE_SLRE0_SIZE                       equ 0001h
SLRCONE_SLRE0_LENGTH                     equ 0001h
SLRCONE_SLRE0_MASK                       equ 0001h
SLRCONE_SLRE1_POSN                       equ 0001h
SLRCONE_SLRE1_POSITION                   equ 0001h
SLRCONE_SLRE1_SIZE                       equ 0001h
SLRCONE_SLRE1_LENGTH                     equ 0001h
SLRCONE_SLRE1_MASK                       equ 0002h
SLRCONE_SLRE2_POSN                       equ 0002h
SLRCONE_SLRE2_POSITION                   equ 0002h
SLRCONE_SLRE2_SIZE                       equ 0001h
SLRCONE_SLRE2_LENGTH                     equ 0001h
SLRCONE_SLRE2_MASK                       equ 0004h

// Register: ODCONE
#define ODCONE ODCONE
ODCONE                                   equ 0F27h
// bitfield definitions
ODCONE_ODCE0_POSN                        equ 0000h
ODCONE_ODCE0_POSITION                    equ 0000h
ODCONE_ODCE0_SIZE                        equ 0001h
ODCONE_ODCE0_LENGTH                      equ 0001h
ODCONE_ODCE0_MASK                        equ 0001h
ODCONE_ODCE1_POSN                        equ 0001h
ODCONE_ODCE1_POSITION                    equ 0001h
ODCONE_ODCE1_SIZE                        equ 0001h
ODCONE_ODCE1_LENGTH                      equ 0001h
ODCONE_ODCE1_MASK                        equ 0002h
ODCONE_ODCE2_POSN                        equ 0002h
ODCONE_ODCE2_POSITION                    equ 0002h
ODCONE_ODCE2_SIZE                        equ 0001h
ODCONE_ODCE2_LENGTH                      equ 0001h
ODCONE_ODCE2_MASK                        equ 0004h

// Register: WPUE
#define WPUE WPUE
WPUE                                     equ 0F28h
// bitfield definitions
WPUE_WPUE0_POSN                          equ 0000h
WPUE_WPUE0_POSITION                      equ 0000h
WPUE_WPUE0_SIZE                          equ 0001h
WPUE_WPUE0_LENGTH                        equ 0001h
WPUE_WPUE0_MASK                          equ 0001h
WPUE_WPUE1_POSN                          equ 0001h
WPUE_WPUE1_POSITION                      equ 0001h
WPUE_WPUE1_SIZE                          equ 0001h
WPUE_WPUE1_LENGTH                        equ 0001h
WPUE_WPUE1_MASK                          equ 0002h
WPUE_WPUE2_POSN                          equ 0002h
WPUE_WPUE2_POSITION                      equ 0002h
WPUE_WPUE2_SIZE                          equ 0001h
WPUE_WPUE2_LENGTH                        equ 0001h
WPUE_WPUE2_MASK                          equ 0004h
WPUE_WPUE3_POSN                          equ 0003h
WPUE_WPUE3_POSITION                      equ 0003h
WPUE_WPUE3_SIZE                          equ 0001h
WPUE_WPUE3_LENGTH                        equ 0001h
WPUE_WPUE3_MASK                          equ 0008h

