GopalSaraf/Practicals/PSDL/include/proc/pic18f45q10.inc
// Register: ADFLTRL
#define ADFLTRL ADFLTRL
ADFLTRL                                  equ 0F6Dh
// bitfield definitions
ADFLTRL_ADFLTRL_POSN                     equ 0000h
ADFLTRL_ADFLTRL_POSITION                 equ 0000h
ADFLTRL_ADFLTRL_SIZE                     equ 0008h
ADFLTRL_ADFLTRL_LENGTH                   equ 0008h
ADFLTRL_ADFLTRL_MASK                     equ 00FFh
ADFLTRL_ADFLTR0_POSN                     equ 0000h
ADFLTRL_ADFLTR0_POSITION                 equ 0000h
ADFLTRL_ADFLTR0_SIZE                     equ 0001h
ADFLTRL_ADFLTR0_LENGTH                   equ 0001h
ADFLTRL_ADFLTR0_MASK                     equ 0001h
ADFLTRL_ADFLTR1_POSN                     equ 0001h
ADFLTRL_ADFLTR1_POSITION                 equ 0001h
ADFLTRL_ADFLTR1_SIZE                     equ 0001h
ADFLTRL_ADFLTR1_LENGTH                   equ 0001h
ADFLTRL_ADFLTR1_MASK                     equ 0002h
ADFLTRL_ADFLTR2_POSN                     equ 0002h
ADFLTRL_ADFLTR2_POSITION                 equ 0002h
ADFLTRL_ADFLTR2_SIZE                     equ 0001h
ADFLTRL_ADFLTR2_LENGTH                   equ 0001h
ADFLTRL_ADFLTR2_MASK                     equ 0004h
ADFLTRL_ADFLTR3_POSN                     equ 0003h
ADFLTRL_ADFLTR3_POSITION                 equ 0003h
ADFLTRL_ADFLTR3_SIZE                     equ 0001h
ADFLTRL_ADFLTR3_LENGTH                   equ 0001h
ADFLTRL_ADFLTR3_MASK                     equ 0008h
ADFLTRL_ADFLTR4_POSN                     equ 0004h
ADFLTRL_ADFLTR4_POSITION                 equ 0004h
ADFLTRL_ADFLTR4_SIZE                     equ 0001h
ADFLTRL_ADFLTR4_LENGTH                   equ 0001h
ADFLTRL_ADFLTR4_MASK                     equ 0010h
ADFLTRL_ADFLTR5_POSN                     equ 0005h
ADFLTRL_ADFLTR5_POSITION                 equ 0005h
ADFLTRL_ADFLTR5_SIZE                     equ 0001h
ADFLTRL_ADFLTR5_LENGTH                   equ 0001h
ADFLTRL_ADFLTR5_MASK                     equ 0020h
ADFLTRL_ADFLTR6_POSN                     equ 0006h
ADFLTRL_ADFLTR6_POSITION                 equ 0006h
ADFLTRL_ADFLTR6_SIZE                     equ 0001h
ADFLTRL_ADFLTR6_LENGTH                   equ 0001h
ADFLTRL_ADFLTR6_MASK                     equ 0040h
ADFLTRL_ADFLTR7_POSN                     equ 0007h
ADFLTRL_ADFLTR7_POSITION                 equ 0007h
ADFLTRL_ADFLTR7_SIZE                     equ 0001h
ADFLTRL_ADFLTR7_LENGTH                   equ 0001h
ADFLTRL_ADFLTR7_MASK                     equ 0080h

// Register: ADFLTRH
#define ADFLTRH ADFLTRH
ADFLTRH                                  equ 0F6Eh
// bitfield definitions
ADFLTRH_ADFLTRH_POSN                     equ 0000h
ADFLTRH_ADFLTRH_POSITION                 equ 0000h
ADFLTRH_ADFLTRH_SIZE                     equ 0008h
ADFLTRH_ADFLTRH_LENGTH                   equ 0008h
ADFLTRH_ADFLTRH_MASK                     equ 00FFh
ADFLTRH_ADFLTR8_POSN                     equ 0000h
ADFLTRH_ADFLTR8_POSITION                 equ 0000h
ADFLTRH_ADFLTR8_SIZE                     equ 0001h
ADFLTRH_ADFLTR8_LENGTH                   equ 0001h
ADFLTRH_ADFLTR8_MASK                     equ 0001h
ADFLTRH_ADFLTR9_POSN                     equ 0001h
ADFLTRH_ADFLTR9_POSITION                 equ 0001h
ADFLTRH_ADFLTR9_SIZE                     equ 0001h
ADFLTRH_ADFLTR9_LENGTH                   equ 0001h
ADFLTRH_ADFLTR9_MASK                     equ 0002h
ADFLTRH_ADFLTR10_POSN                    equ 0002h
ADFLTRH_ADFLTR10_POSITION                equ 0002h
ADFLTRH_ADFLTR10_SIZE                    equ 0001h
ADFLTRH_ADFLTR10_LENGTH                  equ 0001h
ADFLTRH_ADFLTR10_MASK                    equ 0004h
ADFLTRH_ADFLTR11_POSN                    equ 0003h
ADFLTRH_ADFLTR11_POSITION                equ 0003h
ADFLTRH_ADFLTR11_SIZE                    equ 0001h
ADFLTRH_ADFLTR11_LENGTH                  equ 0001h
ADFLTRH_ADFLTR11_MASK                    equ 0008h
ADFLTRH_ADFLTR12_POSN                    equ 0004h
ADFLTRH_ADFLTR12_POSITION                equ 0004h
ADFLTRH_ADFLTR12_SIZE                    equ 0001h
ADFLTRH_ADFLTR12_LENGTH                  equ 0001h
ADFLTRH_ADFLTR12_MASK                    equ 0010h
ADFLTRH_ADFLTR13_POSN                    equ 0005h
ADFLTRH_ADFLTR13_POSITION                equ 0005h
ADFLTRH_ADFLTR13_SIZE                    equ 0001h
ADFLTRH_ADFLTR13_LENGTH                  equ 0001h
ADFLTRH_ADFLTR13_MASK                    equ 0020h
ADFLTRH_ADFLTR14_POSN                    equ 0006h
ADFLTRH_ADFLTR14_POSITION                equ 0006h
ADFLTRH_ADFLTR14_SIZE                    equ 0001h
ADFLTRH_ADFLTR14_LENGTH                  equ 0001h
ADFLTRH_ADFLTR14_MASK                    equ 0040h
ADFLTRH_ADFLTR15_POSN                    equ 0007h
ADFLTRH_ADFLTR15_POSITION                equ 0007h
ADFLTRH_ADFLTR15_SIZE                    equ 0001h
ADFLTRH_ADFLTR15_LENGTH                  equ 0001h
ADFLTRH_ADFLTR15_MASK                    equ 0080h

// Register: CRCDATA
#define CRCDATA CRCDATA
CRCDATA                                  equ 0F6Fh

// Register: CRCDATL
#define CRCDATL CRCDATL
CRCDATL                                  equ 0F6Fh
// bitfield definitions
CRCDATL_DATA0_POSN                       equ 0000h
CRCDATL_DATA0_POSITION                   equ 0000h
CRCDATL_DATA0_SIZE                       equ 0001h
CRCDATL_DATA0_LENGTH                     equ 0001h
CRCDATL_DATA0_MASK                       equ 0001h
CRCDATL_DATA1_POSN                       equ 0001h
CRCDATL_DATA1_POSITION                   equ 0001h
CRCDATL_DATA1_SIZE                       equ 0001h
CRCDATL_DATA1_LENGTH                     equ 0001h
CRCDATL_DATA1_MASK                       equ 0002h
CRCDATL_DATA2_POSN                       equ 0002h
CRCDATL_DATA2_POSITION                   equ 0002h
CRCDATL_DATA2_SIZE                       equ 0001h
CRCDATL_DATA2_LENGTH                     equ 0001h
CRCDATL_DATA2_MASK                       equ 0004h
CRCDATL_DATA3_POSN                       equ 0003h
CRCDATL_DATA3_POSITION                   equ 0003h
CRCDATL_DATA3_SIZE                       equ 0001h
CRCDATL_DATA3_LENGTH                     equ 0001h
CRCDATL_DATA3_MASK                       equ 0008h
CRCDATL_DATA4_POSN                       equ 0004h
CRCDATL_DATA4_POSITION                   equ 0004h
CRCDATL_DATA4_SIZE                       equ 0001h
CRCDATL_DATA4_LENGTH                     equ 0001h
CRCDATL_DATA4_MASK                       equ 0010h
CRCDATL_DATA5_POSN                       equ 0005h
CRCDATL_DATA5_POSITION                   equ 0005h
CRCDATL_DATA5_SIZE                       equ 0001h
CRCDATL_DATA5_LENGTH                     equ 0001h
CRCDATL_DATA5_MASK                       equ 0020h
CRCDATL_DATA6_POSN                       equ 0006h
CRCDATL_DATA6_POSITION                   equ 0006h
CRCDATL_DATA6_SIZE                       equ 0001h
CRCDATL_DATA6_LENGTH                     equ 0001h
CRCDATL_DATA6_MASK                       equ 0040h
CRCDATL_DATA7_POSN                       equ 0007h
CRCDATL_DATA7_POSITION                   equ 0007h
CRCDATL_DATA7_SIZE                       equ 0001h
CRCDATL_DATA7_LENGTH                     equ 0001h
CRCDATL_DATA7_MASK                       equ 0080h

