GopalSaraf/Practicals/PSDL/include/proc/pic18f45q10.inc
#define LC6MODE0                         BANKMASK(CLC6CON), 0, b
#define LC6MODE1                         BANKMASK(CLC6CON), 1, b
#define LC6MODE2                         BANKMASK(CLC6CON), 2, b
#define LC6OUT                           BANKMASK(CLC6CON), 5, b
#define LC6POL                           BANKMASK(CLC6POL), 7, b
#define LC7D1S0                          BANKMASK(CLC7SEL0), 0, b
#define LC7D1S1                          BANKMASK(CLC7SEL0), 1, b
#define LC7D1S2                          BANKMASK(CLC7SEL0), 2, b
#define LC7D1S3                          BANKMASK(CLC7SEL0), 3, b
#define LC7D1S4                          BANKMASK(CLC7SEL0), 4, b
#define LC7D1S5                          BANKMASK(CLC7SEL0), 5, b
#define LC7D1S6                          BANKMASK(CLC7SEL0), 6, b
#define LC7D1S7                          BANKMASK(CLC7SEL0), 7, b
#define LC7D2S0                          BANKMASK(CLC7SEL1), 0, b
#define LC7D2S1                          BANKMASK(CLC7SEL1), 1, b
#define LC7D2S2                          BANKMASK(CLC7SEL1), 2, b
#define LC7D2S3                          BANKMASK(CLC7SEL1), 3, b
#define LC7D2S4                          BANKMASK(CLC7SEL1), 4, b
#define LC7D2S5                          BANKMASK(CLC7SEL1), 5, b
#define LC7D2S6                          BANKMASK(CLC7SEL1), 6, b
#define LC7D2S7                          BANKMASK(CLC7SEL1), 7, b
#define LC7D3S0                          BANKMASK(CLC7SEL2), 0, b
#define LC7D3S1                          BANKMASK(CLC7SEL2), 1, b
#define LC7D3S2                          BANKMASK(CLC7SEL2), 2, b
#define LC7D3S3                          BANKMASK(CLC7SEL2), 3, b
#define LC7D3S4                          BANKMASK(CLC7SEL2), 4, b
#define LC7D3S5                          BANKMASK(CLC7SEL2), 5, b
#define LC7D3S6                          BANKMASK(CLC7SEL2), 6, b
#define LC7D3S7                          BANKMASK(CLC7SEL2), 7, b
#define LC7D4S0                          BANKMASK(CLC7SEL3), 0, b
#define LC7D4S1                          BANKMASK(CLC7SEL3), 1, b
#define LC7D4S2                          BANKMASK(CLC7SEL3), 2, b
#define LC7D4S3                          BANKMASK(CLC7SEL3), 3, b
#define LC7D4S4                          BANKMASK(CLC7SEL3), 4, b
#define LC7D4S5                          BANKMASK(CLC7SEL3), 5, b
#define LC7D4S6                          BANKMASK(CLC7SEL3), 6, b
#define LC7D4S7                          BANKMASK(CLC7SEL3), 7, b
#define LC7EN                            BANKMASK(CLC7CON), 7, b
#define LC7G1D1N                         BANKMASK(CLC7GLS0), 0, b
#define LC7G1D1T                         BANKMASK(CLC7GLS0), 1, b
#define LC7G1D2N                         BANKMASK(CLC7GLS0), 2, b
#define LC7G1D2T                         BANKMASK(CLC7GLS0), 3, b
#define LC7G1D3N                         BANKMASK(CLC7GLS0), 4, b
#define LC7G1D3T                         BANKMASK(CLC7GLS0), 5, b
#define LC7G1D4N                         BANKMASK(CLC7GLS0), 6, b
#define LC7G1D4T                         BANKMASK(CLC7GLS0), 7, b
#define LC7G1POL                         BANKMASK(CLC7POL), 0, b
#define LC7G2D1N                         BANKMASK(CLC7GLS1), 0, b
#define LC7G2D1T                         BANKMASK(CLC7GLS1), 1, b
#define LC7G2D2N                         BANKMASK(CLC7GLS1), 2, b
#define LC7G2D2T                         BANKMASK(CLC7GLS1), 3, b
#define LC7G2D3N                         BANKMASK(CLC7GLS1), 4, b
#define LC7G2D3T                         BANKMASK(CLC7GLS1), 5, b
#define LC7G2D4N                         BANKMASK(CLC7GLS1), 6, b
#define LC7G2D4T                         BANKMASK(CLC7GLS1), 7, b
#define LC7G2POL                         BANKMASK(CLC7POL), 1, b
#define LC7G3D1N                         BANKMASK(CLC7GLS2), 0, b
#define LC7G3D1T                         BANKMASK(CLC7GLS2), 1, b
#define LC7G3D2N                         BANKMASK(CLC7GLS2), 2, b
#define LC7G3D2T                         BANKMASK(CLC7GLS2), 3, b
#define LC7G3D3N                         BANKMASK(CLC7GLS2), 4, b
#define LC7G3D3T                         BANKMASK(CLC7GLS2), 5, b
#define LC7G3D4N                         BANKMASK(CLC7GLS2), 6, b
#define LC7G3D4T                         BANKMASK(CLC7GLS2), 7, b
#define LC7G3POL                         BANKMASK(CLC7POL), 2, b
#define LC7G4D1N                         BANKMASK(CLC7GLS3), 0, b
#define LC7G4D1T                         BANKMASK(CLC7GLS3), 1, b
#define LC7G4D2N                         BANKMASK(CLC7GLS3), 2, b
#define LC7G4D2T                         BANKMASK(CLC7GLS3), 3, b
#define LC7G4D3N                         BANKMASK(CLC7GLS3), 4, b
#define LC7G4D3T                         BANKMASK(CLC7GLS3), 5, b
#define LC7G4D4N                         BANKMASK(CLC7GLS3), 6, b
#define LC7G4D4T                         BANKMASK(CLC7GLS3), 7, b
#define LC7G4POL                         BANKMASK(CLC7POL), 3, b
#define LC7INTN                          BANKMASK(CLC7CON), 3, b
#define LC7INTP                          BANKMASK(CLC7CON), 4, b
#define LC7MODE0                         BANKMASK(CLC7CON), 0, b
#define LC7MODE1                         BANKMASK(CLC7CON), 1, b
#define LC7MODE2                         BANKMASK(CLC7CON), 2, b
#define LC7OUT                           BANKMASK(CLC7CON), 5, b
#define LC7POL                           BANKMASK(CLC7POL), 7, b
#define LC8D1S0                          BANKMASK(CLC8SEL0), 0, b
#define LC8D1S1                          BANKMASK(CLC8SEL0), 1, b
#define LC8D1S2                          BANKMASK(CLC8SEL0), 2, b
#define LC8D1S3                          BANKMASK(CLC8SEL0), 3, b
#define LC8D1S4                          BANKMASK(CLC8SEL0), 4, b
#define LC8D1S5                          BANKMASK(CLC8SEL0), 5, b
#define LC8D1S6                          BANKMASK(CLC8SEL0), 6, b
#define LC8D1S7                          BANKMASK(CLC8SEL0), 7, b
#define LC8D2S0                          BANKMASK(CLC8SEL1), 0, b
#define LC8D2S1                          BANKMASK(CLC8SEL1), 1, b
#define LC8D2S2                          BANKMASK(CLC8SEL1), 2, b
#define LC8D2S3                          BANKMASK(CLC8SEL1), 3, b
#define LC8D2S4                          BANKMASK(CLC8SEL1), 4, b
#define LC8D2S5                          BANKMASK(CLC8SEL1), 5, b
#define LC8D2S6                          BANKMASK(CLC8SEL1), 6, b
#define LC8D2S7                          BANKMASK(CLC8SEL1), 7, b
#define LC8D3S0                          BANKMASK(CLC8SEL2), 0, b
#define LC8D3S1                          BANKMASK(CLC8SEL2), 1, b
#define LC8D3S2                          BANKMASK(CLC8SEL2), 2, b
#define LC8D3S3                          BANKMASK(CLC8SEL2), 3, b
#define LC8D3S4                          BANKMASK(CLC8SEL2), 4, b
#define LC8D3S5                          BANKMASK(CLC8SEL2), 5, b
#define LC8D3S6                          BANKMASK(CLC8SEL2), 6, b
#define LC8D3S7                          BANKMASK(CLC8SEL2), 7, b
#define LC8D4S0                          BANKMASK(CLC8SEL3), 0, b
#define LC8D4S1                          BANKMASK(CLC8SEL3), 1, b
#define LC8D4S2                          BANKMASK(CLC8SEL3), 2, b
#define LC8D4S3                          BANKMASK(CLC8SEL3), 3, b
#define LC8D4S4                          BANKMASK(CLC8SEL3), 4, b
#define LC8D4S5                          BANKMASK(CLC8SEL3), 5, b
#define LC8D4S6                          BANKMASK(CLC8SEL3), 6, b
#define LC8D4S7                          BANKMASK(CLC8SEL3), 7, b
#define LC8EN                            BANKMASK(CLC8CON), 7, b
#define LC8G1D1N                         BANKMASK(CLC8GLS0), 0, b
#define LC8G1D1T                         BANKMASK(CLC8GLS0), 1, b
#define LC8G1D2N                         BANKMASK(CLC8GLS0), 2, b
#define LC8G1D2T                         BANKMASK(CLC8GLS0), 3, b
#define LC8G1D3N                         BANKMASK(CLC8GLS0), 4, b
#define LC8G1D3T                         BANKMASK(CLC8GLS0), 5, b
#define LC8G1D4N                         BANKMASK(CLC8GLS0), 6, b
#define LC8G1D4T                         BANKMASK(CLC8GLS0), 7, b
#define LC8G1POL                         BANKMASK(CLC8POL), 0, b
#define LC8G2D1N                         BANKMASK(CLC8GLS1), 0, b
#define LC8G2D1T                         BANKMASK(CLC8GLS1), 1, b
#define LC8G2D2N                         BANKMASK(CLC8GLS1), 2, b
#define LC8G2D2T                         BANKMASK(CLC8GLS1), 3, b
#define LC8G2D3N                         BANKMASK(CLC8GLS1), 4, b
#define LC8G2D3T                         BANKMASK(CLC8GLS1), 5, b
#define LC8G2D4N                         BANKMASK(CLC8GLS1), 6, b
#define LC8G2D4T                         BANKMASK(CLC8GLS1), 7, b
#define LC8G2POL                         BANKMASK(CLC8POL), 1, b
#define LC8G3D1N                         BANKMASK(CLC8GLS2), 0, b
#define LC8G3D1T                         BANKMASK(CLC8GLS2), 1, b
#define LC8G3D2N                         BANKMASK(CLC8GLS2), 2, b
#define LC8G3D2T                         BANKMASK(CLC8GLS2), 3, b
#define LC8G3D3N                         BANKMASK(CLC8GLS2), 4, b
#define LC8G3D3T                         BANKMASK(CLC8GLS2), 5, b
#define LC8G3D4N                         BANKMASK(CLC8GLS2), 6, b
#define LC8G3D4T                         BANKMASK(CLC8GLS2), 7, b
#define LC8G3POL                         BANKMASK(CLC8POL), 2, b
#define LC8G4D1N                         BANKMASK(CLC8GLS3), 0, b
#define LC8G4D1T                         BANKMASK(CLC8GLS3), 1, b
#define LC8G4D2N                         BANKMASK(CLC8GLS3), 2, b
#define LC8G4D2T                         BANKMASK(CLC8GLS3), 3, b
#define LC8G4D3N                         BANKMASK(CLC8GLS3), 4, b
#define LC8G4D3T                         BANKMASK(CLC8GLS3), 5, b
#define LC8G4D4N                         BANKMASK(CLC8GLS3), 6, b
#define LC8G4D4T                         BANKMASK(CLC8GLS3), 7, b
#define LC8G4POL                         BANKMASK(CLC8POL), 3, b
#define LC8INTN                          BANKMASK(CLC8CON), 3, b
#define LC8INTP                          BANKMASK(CLC8CON), 4, b
#define LC8MODE0                         BANKMASK(CLC8CON), 0, b
#define LC8MODE1                         BANKMASK(CLC8CON), 1, b
#define LC8MODE2                         BANKMASK(CLC8CON), 2, b
#define LC8OUT                           BANKMASK(CLC8CON), 5, b
#define LC8POL                           BANKMASK(CLC8POL), 7, b
#define LD                               BANKMASK(CWG1CON0), 6, b
#define LFOEN                            BANKMASK(OSCEN), 4, b
#define LFOR                             BANKMASK(OSCSTAT), 4, b
#define LSAC0                            BANKMASK(CWG1AS0), 2, b
#define LSAC1                            BANKMASK(CWG1AS0), 3, b
#define LSBD0                            BANKMASK(CWG1AS0), 4, b
#define LSBD1                            BANKMASK(CWG1AS0), 5, b
#define MC1OUT                           BANKMASK(CMOUT), 0, b
#define MC2OUT                           BANKMASK(CMOUT), 1, b
#define MCL1OUT                          BANKMASK(CLCDATA), 0, b
#define MDBIT                            BANKMASK(MDCON0), 0, b
#define MDCARHPPS0                       BANKMASK(MDCARHPPS), 0, b
#define MDCARHPPS1                       BANKMASK(MDCARHPPS), 1, b
#define MDCARHPPS2                       BANKMASK(MDCARHPPS), 2, b
#define MDCARHPPS3                       BANKMASK(MDCARHPPS), 3, b
#define MDCARHPPS4                       BANKMASK(MDCARHPPS), 4, b
#define MDCARLPPS0                       BANKMASK(MDCARLPPS), 0, b
#define MDCARLPPS1                       BANKMASK(MDCARLPPS), 1, b
#define MDCARLPPS2                       BANKMASK(MDCARLPPS), 2, b
#define MDCARLPPS3                       BANKMASK(MDCARLPPS), 3, b
#define MDCARLPPS4                       BANKMASK(MDCARLPPS), 4, b
#define MDCHPOL                          BANKMASK(MDCON1), 5, b
#define MDCHS0                           BANKMASK(MDCARH), 0, b
#define MDCHS1                           BANKMASK(MDCARH), 1, b
#define MDCHS2                           BANKMASK(MDCARH), 2, b
#define MDCHSYNC                         BANKMASK(MDCON1), 4, b
#define MDCLPOL                          BANKMASK(MDCON1), 1, b
#define MDCLS0                           BANKMASK(MDCARL), 0, b
#define MDCLS1                           BANKMASK(MDCARL), 1, b
#define MDCLS2                           BANKMASK(MDCARL), 2, b
#define MDCLSYNC                         BANKMASK(MDCON1), 0, b
#define MDEN                             BANKMASK(MDCON0), 7, b
#define MDOPOL                           BANKMASK(MDCON0), 4, b
#define MDOUT                            BANKMASK(MDCON0), 5, b
#define MDSRCPPS0                        BANKMASK(MDSRCPPS), 0, b
#define MDSRCPPS1                        BANKMASK(MDSRCPPS), 1, b
#define MDSRCPPS2                        BANKMASK(MDSRCPPS), 2, b
#define MDSRCPPS3                        BANKMASK(MDSRCPPS), 3, b
#define MDSRCPPS4                        BANKMASK(MDSRCPPS), 4, b
#define MDSRCS0                          BANKMASK(MDSRC), 0, b
#define MDSRCS1                          BANKMASK(MDSRC), 1, b
#define MDSRCS2                          BANKMASK(MDSRC), 2, b
#define MDSRCS3                          BANKMASK(MDSRC), 3, b
#define MFOEN                            BANKMASK(OSCEN), 5, b
#define MFOR                             BANKMASK(OSCSTAT), 5, b
#define MLC2OUT                          BANKMASK(CLCDATA), 1, b
#define MLC3OUT                          BANKMASK(CLCDATA), 2, b
#define MLC4OUT                          BANKMASK(CLCDATA), 3, b
#define MLC5OUT                          BANKMASK(CLCDATA), 4, b
#define MLC6OUT                          BANKMASK(CLCDATA), 5, b
#define MLC7OUT                          BANKMASK(CLCDATA), 6, b
#define MLC8OUT                          BANKMASK(CLCDATA), 7, b
#define MSK01                            BANKMASK(SSP1ADD), 0, a
#define MSK02                            BANKMASK(SSP2ADD), 0, b
#define MSK11                            BANKMASK(SSP1ADD), 1, a
#define MSK12                            BANKMASK(SSP2ADD), 1, b
#define MSK21                            BANKMASK(SSP1ADD), 2, a
#define MSK22                            BANKMASK(SSP2ADD), 2, b
#define MSK31                            BANKMASK(SSP1ADD), 3, a
#define MSK32                            BANKMASK(SSP2ADD), 3, b
#define MSK41                            BANKMASK(SSP1ADD), 4, a
#define MSK42                            BANKMASK(SSP2ADD), 4, b
#define MSK51                            BANKMASK(SSP1ADD), 5, a
#define MSK52                            BANKMASK(SSP2ADD), 5, b
#define MSK61                            BANKMASK(SSP1ADD), 6, a
#define MSK62                            BANKMASK(SSP2ADD), 6, b
#define MSK71                            BANKMASK(SSP1ADD), 7, a
#define MSK72                            BANKMASK(SSP2ADD), 7, b
#define MSSP1MD                          BANKMASK(PMD4), 4, b
#define MSSP2MD                          BANKMASK(PMD4), 5, b
#define NDIV0                            BANKMASK(OSCCON1), 0, b
#define NDIV1                            BANKMASK(OSCCON1), 1, b
#define NDIV2                            BANKMASK(OSCCON1), 2, b
#define NDIV3                            BANKMASK(OSCCON1), 3, b
#define NOSC0                            BANKMASK(OSCCON1), 4, b
#define NOSC1                            BANKMASK(OSCCON1), 5, b
#define NOSC2                            BANKMASK(OSCCON1), 6, b
#define NOSCR                            BANKMASK(OSCCON3), 3, b
#define NOT_ADDRESS1                     BANKMASK(SSP1STAT), 5, a
#define NOT_ADDRESS2                     BANKMASK(SSP2STAT), 5, b
#define NOT_BOR                          BANKMASK(PCON0), 0, a
#define NOT_PD                           BANKMASK(STATUS), 5, a
#define NOT_POR                          BANKMASK(PCON0), 1, a
#define NOT_RCM                          BANKMASK(PCON1), 0, a
#define NOT_RI                           BANKMASK(PCON0), 2, a
#define NOT_RMCLR                        BANKMASK(PCON0), 3, a
#define NOT_RVREG                        BANKMASK(PCON1), 2, a
#define NOT_RWDT                         BANKMASK(PCON0), 4, a
#define NOT_T1SYNC                       BANKMASK(T1CON), 2, a
#define NOT_T3SYNC                       BANKMASK(T3CON), 2, a
#define NOT_T5SYNC                       BANKMASK(T5CON), 2, a
#define NOT_TO                           BANKMASK(STATUS), 6, a
#define NOT_WDTWV                        BANKMASK(PCON0), 5, a
#define NOT_WRITE1                       BANKMASK(SSP1STAT), 2, a
#define NOT_WRITE2                       BANKMASK(SSP2STAT), 2, b
#define NSS                              BANKMASK(DAC1CON0), 0, b
#define NVMADR0                          BANKMASK(NVMADRL), 0, a
#define NVMADR1                          BANKMASK(NVMADRL), 1, a
#define NVMADR10                         BANKMASK(NVMADRH), 2, a
#define NVMADR11                         BANKMASK(NVMADRH), 3, a
#define NVMADR12                         BANKMASK(NVMADRH), 4, a
#define NVMADR13                         BANKMASK(NVMADRH), 5, a
#define NVMADR14                         BANKMASK(NVMADRH), 6, a
#define NVMADR15                         BANKMASK(NVMADRH), 7, a
#define NVMADR16                         BANKMASK(NVMADRU), 0, a
#define NVMADR17                         BANKMASK(NVMADRU), 1, a
#define NVMADR18                         BANKMASK(NVMADRU), 2, a
#define NVMADR19                         BANKMASK(NVMADRU), 3, a
#define NVMADR2                          BANKMASK(NVMADRL), 2, a
#define NVMADR20                         BANKMASK(NVMADRU), 4, a
#define NVMADR21                         BANKMASK(NVMADRU), 5, a
#define NVMADR3                          BANKMASK(NVMADRL), 3, a
#define NVMADR4                          BANKMASK(NVMADRL), 4, a
#define NVMADR5                          BANKMASK(NVMADRL), 5, a
#define NVMADR6                          BANKMASK(NVMADRL), 6, a
#define NVMADR7                          BANKMASK(NVMADRL), 7, a
#define NVMADR8                          BANKMASK(NVMADRH), 0, a
#define NVMADR9                          BANKMASK(NVMADRH), 1, a
#define NVMDAT0                          BANKMASK(NVMDATL), 0, a
#define NVMDAT1                          BANKMASK(NVMDATL), 1, a
#define NVMDAT10                         BANKMASK(NVMDATH), 2, a
#define NVMDAT11                         BANKMASK(NVMDATH), 3, a
#define NVMDAT12                         BANKMASK(NVMDATH), 4, a
#define NVMDAT13                         BANKMASK(NVMDATH), 5, a
#define NVMDAT14                         BANKMASK(NVMDATH), 6, a
#define NVMDAT15                         BANKMASK(NVMDATH), 7, a
#define NVMDAT2                          BANKMASK(NVMDATL), 2, a
#define NVMDAT3                          BANKMASK(NVMDATL), 3, a
#define NVMDAT4                          BANKMASK(NVMDATL), 4, a
#define NVMDAT5                          BANKMASK(NVMDATL), 5, a
#define NVMDAT6                          BANKMASK(NVMDATL), 6, a
#define NVMDAT7                          BANKMASK(NVMDATL), 7, a
#define NVMDAT8                          BANKMASK(NVMDATH), 0, a
#define NVMDAT9                          BANKMASK(NVMDATH), 1, a
#define NVMEN                            BANKMASK(NVMCON0), 7, a
#define NVMERR                           BANKMASK(NVMCON0), 4, a
#define NVMIE                            BANKMASK(PIE7), 5, b
#define NVMIF                            BANKMASK(PIR7), 5, b
#define NVMIP                            BANKMASK(IPR7), 5, b
#define NVMMD                            BANKMASK(PMD0), 2, b
#define ODCA0                            BANKMASK(ODCONA), 0, b
#define ODCA1                            BANKMASK(ODCONA), 1, b
#define ODCA2                            BANKMASK(ODCONA), 2, b
#define ODCA3                            BANKMASK(ODCONA), 3, b
#define ODCA4                            BANKMASK(ODCONA), 4, b
#define ODCA5                            BANKMASK(ODCONA), 5, b
#define ODCA6                            BANKMASK(ODCONA), 6, b
#define ODCA7                            BANKMASK(ODCONA), 7, b
#define ODCB0                            BANKMASK(ODCONB), 0, b
#define ODCB1                            BANKMASK(ODCONB), 1, b
#define ODCB2                            BANKMASK(ODCONB), 2, b
#define ODCB3                            BANKMASK(ODCONB), 3, b
#define ODCB4                            BANKMASK(ODCONB), 4, b
#define ODCB5                            BANKMASK(ODCONB), 5, b
#define ODCB6                            BANKMASK(ODCONB), 6, b
#define ODCB7                            BANKMASK(ODCONB), 7, b
#define ODCC0                            BANKMASK(ODCONC), 0, b
#define ODCC1                            BANKMASK(ODCONC), 1, b
#define ODCC2                            BANKMASK(ODCONC), 2, b
#define ODCC3                            BANKMASK(ODCONC), 3, b
#define ODCC4                            BANKMASK(ODCONC), 4, b
#define ODCC5                            BANKMASK(ODCONC), 5, b
#define ODCC6                            BANKMASK(ODCONC), 6, b
#define ODCC7                            BANKMASK(ODCONC), 7, b
#define ODCD0                            BANKMASK(ODCOND), 0, b
#define ODCD1                            BANKMASK(ODCOND), 1, b
#define ODCD2                            BANKMASK(ODCOND), 2, b
#define ODCD3                            BANKMASK(ODCOND), 3, b
#define ODCD4                            BANKMASK(ODCOND), 4, b
#define ODCD5                            BANKMASK(ODCOND), 5, b
#define ODCD6                            BANKMASK(ODCOND), 6, b
#define ODCD7                            BANKMASK(ODCOND), 7, b
#define ODCE0                            BANKMASK(ODCONE), 0, b
#define ODCE1                            BANKMASK(ODCONE), 1, b
#define ODCE2                            BANKMASK(ODCONE), 2, b
#define OE1                              BANKMASK(DAC1CON0), 5, b
#define OE2                              BANKMASK(DAC1CON0), 4, b
#define OPOL                             BANKMASK(MDCON0), 4, b
#define ORDY                             BANKMASK(OSCCON3), 4, b
#define OSCFIE                           BANKMASK(PIE1), 7, b
#define OSCFIF                           BANKMASK(PIR1), 7, b
#define OSCFIP                           BANKMASK(IPR1), 7, b
#define OV                               BANKMASK(STATUS), 3, a
#define OVRA                             BANKMASK(CWG1STR), 4, b
#define OVRB                             BANKMASK(CWG1STR), 5, b
#define OVRC                             BANKMASK(CWG1STR), 6, b
#define OVRD                             BANKMASK(CWG1STR), 7, b
#define P3TSEL0                          BANKMASK(CCPTMRS), 4, a
#define P3TSEL1                          BANKMASK(CCPTMRS), 5, a
#define P4TSEL0                          BANKMASK(CCPTMRS), 6, a
#define P4TSEL1                          BANKMASK(CCPTMRS), 7, a
#define PD                               BANKMASK(STATUS), 5, a
#define PEIE                             BANKMASK(INTCON), 6, a
#define PEIE_GIEL                        BANKMASK(INTCON), 6, a
#define PEN1                             BANKMASK(SSP1CON2), 2, a
#define PEN2                             BANKMASK(SSP2CON2), 2, b
#define PLEN0                            BANKMASK(CRCCON1), 0, a
#define PLEN1                            BANKMASK(CRCCON1), 1, a
#define PLEN2                            BANKMASK(CRCCON1), 2, a
#define PLEN3                            BANKMASK(CRCCON1), 3, a
#define PLLR                             BANKMASK(OSCSTAT), 0, b
#define PMSYS0                           BANKMASK(VREGCON), 4, b
#define PMSYS1                           BANKMASK(VREGCON), 5, b
#define POLA                             BANKMASK(CWG1CON1), 0, b
#define POLB                             BANKMASK(CWG1CON1), 1, b
#define POLC                             BANKMASK(CWG1CON1), 2, b
#define POLD                             BANKMASK(CWG1CON1), 3, b
#define POR                              BANKMASK(PCON0), 1, a
#define PPSLOCKED                        BANKMASK(PPSLOCK), 0, b
#define PSCNT0                           BANKMASK(WDTPSL), 0, b
#define PSCNT1                           BANKMASK(WDTPSL), 1, b
